УНФ_ТЕСТ/src/Catalogs/ЗаписиКалендаряПодготовкиОтчетности/ЗаписиКалендаряПодготовкиОтчетности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЗаписиКалендаряПодготовкиОтчетности</name>
  <attributes>
    <name>ДатаСменыСостояния</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>AnyRef</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Завершено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СобытиеКалендаря</name>
    <type>
      <types>CatalogRef.КалендарьПодготовкиОтчетности</types>
      <types>CatalogRef.КалендарьПерсональныхЗадачОтчетности</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияСобытийКалендаря</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНалога</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоТочныйРасчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеСуммыНалога</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

УНФ_ТЕСТ/src/Enums/СостоянияСобытийКалендаря/СостоянияСобытийКалендаря.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияСобытийКалендаря</name>
  <enumValues>
    <name>Заполнить</name>
  </enumValues>
  <enumValues>
    <name>Проверить</name>
  </enumValues>
  <enumValues>
    <name>Рассчитать</name>
  </enumValues>
  <enumValues>
    <name>Сформировать</name>
  </enumValues>
  <enumValues>
    <name>Уплатить</name>
  </enumValues>
  <enumValues>
    <name>Распечатать</name>
  </enumValues>
  <enumValues>
    <name>Сохранить</name>
  </enumValues>
  <enumValues>
    <name>Отправить</name>
  </enumValues>
  <enumValues>
    <name>ЗарегистрироватьУплату</name>
  </enumValues>
  <enumValues>
    <name>ПолучитьПодтверждение</name>
  </enumValues>
  <enumValues>
    <name>Завершено</name>
  </enumValues>
  <enumValues>
    <name>НеНачато</name>
  </enumValues>
  <enumValues>
    <name>Ознакомиться</name>
  </enumValues>
  <enumValues>
    <name>Завершить</name>
  </enumValues>
  <enumValues>
    <name>ОтчетНеСдан</name>
  </enumValues>
</mdclass:Enum>

УНФ_ТЕСТ/src/Catalogs/ЗаписиКалендаряПодготовкиОтчетности/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПолучитьЗаписьКалендаря(Организация, СобытиеКалендаря) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЗаписиКалендаряПодготовкиОтчетности.Ссылка
	|ИЗ
	|	Справочник.ЗаписиКалендаряПодготовкиОтчетности КАК ЗаписиКалендаряПодготовкиОтчетности
	|ГДЕ
	|	ЗаписиКалендаряПодготовкиОтчетности.Организация = &Организация
	|	И ЗаписиКалендаряПодготовкиОтчетности.СобытиеКалендаря = &СобытиеКалендаря
	|	И НЕ ЗаписиКалендаряПодготовкиОтчетности.ПометкаУдаления");
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СобытиеКалендаря", СобытиеКалендаря);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьИмяФормыПоЗадачеИСостоянию(Задача, Состояние) Экспорт
	
	Если Состояние = Перечисления.СостоянияСобытийКалендаря.НеНачато
		ИЛИ Состояние = Перечисления.СостоянияСобытийКалендаря.Заполнить
		ИЛИ Состояние = Перечисления.СостоянияСобытийКалендаря.Проверить
		ИЛИ Состояние = Перечисления.СостоянияСобытийКалендаря.Рассчитать
		ИЛИ Состояние = Перечисления.СостоянияСобытийКалендаря.Сформировать Тогда
		Возврат "Обработка.ОбработкиНалоговИОтчетности.Форма.ОписанияЗадачИСтартВыполнения";
	Иначе
		
		Если Задача = Справочники.ЗадачиКалендаряПодготовкиОтчетности.АвансовыйПлатежПоУСН Тогда
			Возврат "Обработка.ОбработкиНалоговИОтчетности.Форма.АвансовыйПлатежПоУСН";
		ИначеЕсли Задача = Справочники.ЗадачиКалендаряПодготовкиОтчетности.ЕдиныйНалогЕНВД Тогда
			Возврат "Обработка.ОбработкиНалоговИОтчетности.Форма.ЕдиныйНалогЕНВД";
		ИначеЕсли Задача = Справочники.ЗадачиКалендаряПодготовкиОтчетности.НалогиСотрудников Тогда
			Возврат "Обработка.ОбработкиНалоговИОтчетности.Форма.НалогиСотрудников";
		ИначеЕсли Задача = Справочники.ЗадачиКалендаряПодготовкиОтчетности.ЕдиныйНалог Тогда
			Возврат "Обработка.ОбработкиНалоговИОтчетности.Форма.ЕдиныйНалог";
		ИначеЕсли Задача = Справочники.ЗадачиКалендаряПодготовкиОтчетности.СтраховыеВзносыИП Тогда
			Возврат "Обработка.ОбработкиНалоговИОтчетности.Форма.СтраховыеВзносыИП";
		ИначеЕсли Задача = Справочники.ЗадачиКалендаряПодготовкиОтчетности.СтраховыеВзносыПриДоходахСвыше300тр Тогда
			Возврат "Обработка.ОбработкиНалоговИОтчетности.Форма.СтраховыеВзносыПриДоходахСвыше300тр";
		ИначеЕсли Задача = Справочники.ЗадачиКалендаряПодготовкиОтчетности.ДекларацияПоУСН Тогда
			Возврат "Обработка.ОбработкиНалоговИОтчетности.Форма.ДекларацияПоУСН";
		ИначеЕсли Задача = Справочники.ЗадачиКалендаряПодготовкиОтчетности.ДекларацияПоЕНВД Тогда
			Возврат "Обработка.ОбработкиНалоговИОтчетности.Форма.ДекларацияПоЕНВД";
		ИначеЕсли Задача = Справочники.ЗадачиКалендаряПодготовкиОтчетности.ОтчетностьВПФР Тогда
			Возврат "Обработка.ОбработкиНалоговИОтчетности.Форма.ОтчетностьВПФР";
		ИначеЕсли Задача = Справочники.ЗадачиКалендаряПодготовкиОтчетности.Справки2НДФЛ Тогда
			Возврат "Обработка.ОбработкиНалоговИОтчетности.Форма.Справки2НДФЛ";
		ИначеЕсли Задача = Справочники.ЗадачиКалендаряПодготовкиОтчетности.СреднесписочнаяЧисленность Тогда
			Возврат "Обработка.ОбработкиНалоговИОтчетности.Форма.СведенияОСреднесписочнойЧисленности";
		ИначеЕсли Задача = Справочники.ЗадачиКалендаряПодготовкиОтчетности.Форма4ФСС Тогда
			Возврат "Обработка.ОбработкиНалоговИОтчетности.Форма.Форма4ФСС";
		ИначеЕсли Задача = Справочники.ЗадачиКалендаряПодготовкиОтчетности.НалогПатент Тогда
			Возврат "Обработка.ОбработкиНалоговИОтчетности.Форма.НалогПатент";
		ИначеЕсли Задача = Справочники.ЗадачиКалендаряПодготовкиОтчетности.ТорговыйСбор Тогда
			Возврат "Обработка.ОбработкиНалоговИОтчетности.Форма.ТорговыйСбор";
		ИначеЕсли Задача = Справочники.ЗадачиКалендаряПодготовкиОтчетности.Форма1Предприниматель Тогда
			Возврат "Обработка.ОбработкиНалоговИОтчетности.Форма.Форма1Предприниматель";
		ИначеЕсли Задача = Справочники.ЗадачиКалендаряПодготовкиОтчетности.Форма6НДФЛ Тогда
			Возврат "Обработка.ОбработкиНалоговИОтчетности.Форма.Форма6НДФЛ";
		ИначеЕсли Задача = Справочники.ЗадачиКалендаряПодготовкиОтчетности.СведенияОЗастрахованныхЛицах Тогда
			Возврат "Обработка.ОбработкиНалоговИОтчетности.Форма.СведенияОЗастрахованныхЛицах";
		ИначеЕсли Задача = Справочники.ЗадачиКалендаряПодготовкиОтчетности.Декларация12 Тогда
			Возврат "Обработка.ОбработкиНалоговИОтчетности.Форма.Декларация12";
		ИначеЕсли Задача = Справочники.ЗадачиКалендаряПодготовкиОтчетности.РасчетПоСтраховымВзносам Тогда
			Возврат "Обработка.ОбработкиНалоговИОтчетности.Форма.РасчетПоСтраховымВзносам";
		ИначеЕсли Задача = Справочники.ЗадачиКалендаряПодготовкиОтчетности.СЗВСтаж Тогда
			Возврат "Обработка.ОбработкиНалоговИОтчетности.Форма.СЗВСтаж";
		Иначе
			Возврат "";
		КонецЕсли;
	КонецЕсли;
	
КонецФункции


#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область ИнтерфейсКалендаряСотрудника

// Функция определяет пиктограмму для элемента записи календаря
//
// Параметры:
//  ЗаписьКалендаряПодготовкиОтчетности	 - СправочникСсылка.ЗаписьКалендаряПодготовкиОтчетности
// 
// Возвращаемое значение:
//  Картинка - пиктограмма записи календаря
//
Функция КартинкаЗаписиКалендаря(ЗаписьКалендаряПодготовкиОтчетности) Экспорт
	
	Возврат Новый Картинка;
	
КонецФункции

// Функция определяет цвет текста для элемента записи календаря
//
// Параметры:
//  ЗаписьКалендаряПодготовкиОтчетности	 - СправочникСсылка.ЗаписьКалендаряПодготовкиОтчетности
// 
// Возвращаемое значение:
//  Цвет - цвет текста записи календаря
//
Функция ЦветТекстаЗаписиКалендаря(ЗаписьКалендаряПодготовкиОтчетности) Экспорт
	
	Возврат Новый Цвет;
	
КонецФункции

// Процедура заполняет таблицу описаний расширенного ввода записи календаря
//
// Параметры:
//  ТаблицаОписаний	 - ТаблицаЗначений	 - описание колонок см. Справочник.ЗаписиКалендаряСотрудника.ПриЗаполненииРасширенногоВводаЗаписиКалендаря()
//
Процедура ПриЗаполненииРасширенногоВводаЗаписиКалендаря(ТаблицаОписаний) Экспорт
	
	// Запись календаря подготовки отчетности не редактируется пользователем
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
